In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [11]:
x = df.drop('Survived',axis='columns')
y = df.Survived

In [27]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [12]:
dummies = pd.get_dummies(x.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [13]:
x = pd.concat([x,dummies],axis='columns')
x.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [14]:
x.drop(['Sex','male'],axis='columns',inplace=True)
x.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [16]:
x.columns[x.isna().any()]

Index(['Age'], dtype='object')

In [17]:
x.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [18]:
x.Age = x.Age.fillna(x.Age.mean())
x.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [20]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(x,y,test_size=0.3)

### Naive Bayes

In [21]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [22]:
model.fit(X_train,y_train)

GaussianNB()

In [23]:
model.score(X_test,y_test)

0.7835820895522388

In [24]:
model.predict(X_test[0:10])

array([1, 0, 1, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [25]:
model.predict_proba(X_test[:10])

array([[1.74302280e-04, 9.99825698e-01],
       [9.26755555e-01, 7.32444449e-02],
       [3.15633746e-02, 9.68436625e-01],
       [9.57881306e-01, 4.21186944e-02],
       [8.03003542e-01, 1.96996458e-01],
       [2.74560796e-01, 7.25439204e-01],
       [9.40583935e-01, 5.94160652e-02],
       [9.63590098e-01, 3.64099023e-02],
       [9.59551564e-01, 4.04484357e-02],
       [9.58446317e-01, 4.15536830e-02]])

**Calculate the score using cross validation**

In [26]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.776     , 0.744     , 0.728     , 0.87903226, 0.78225806])